<?xml version="1.0" ?>
<net batch="1" name="discriminator" version="6">
	<layers>
		<layer id="0" name="input.1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="9" precision="FP32" type="FullyConnected">
			<data out-size="1024"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3211264"/>
				<biases offset="3211264" size="4096"/>
			</blobs>
		</layer>
		<layer id="2" name="10" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="11" precision="FP32" type="FullyConnected">
			<data out-size="512"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3215360" size="2097152"/>
				<biases offset="5312512" size="2048"/>
			</blobs>
		</layer>
		<layer id="4" name="12" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="13" precision="FP32" type="FullyConnected">
			<data out-size="256"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5314560" size="524288"/>
				<biases offset="5838848" size="1024"/>
			</blobs>
		</layer>
		<layer id="6" name="14" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="15" precision="FP32" type="FullyConnected">
			<data out-size="1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5839872" size="1024"/>
				<biases offset="5840896" size="4"/>
			</blobs>
		</layer>
		<layer id="8" name="16" precision="FP32" type="Activation">
			<data type="sigmoid"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<data_type value="float"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/discriminator.onnx"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_shape, model_name, output, placeholder_shapes, scale"/>
		</cli_parameters>
	</meta_data>
</net>
